app/views/tags/show.html.erb

      <div class='count-box'>
        <p class='count'> <%= question.answers.count %> </p>
---
SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 1]]

        </h3>
        <% question.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "question_tags" ON "tags"."id" = "question_tags"."tag_id" WHERE "question_tags"."question_id" = $1  [["question_id", 1]]