app/controllers/answers_controller.rb

INSERT INTO "answers" ("body", "question_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "asdfaf"], ["question_id", 1], ["user_id", 1], ["created_at", "2015-08-02 02:14:28.061258"], ["updated_at", "2015-08-02 02:14:28.061258"]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
---
  def create
    answer = Answer.new(answer_params)
    if answer.save
      question = Question.find_by(id: answer.question_id)